product_lists = [
            'апельсин',
            'болгарский перец',
            'говядина',
            'гречка',
            'котлета',
            'курица',
            'лимон',
            'макароны',
            'огурец',
            'помидор',
            'пюре',
            'салат',
            'тыква',
            'хлеб белый',
            'хлеб черный'
]

product_classes_idx = {
            'апельсин' : 0,
            'болгарский перец' : 1,
            'говядина' : 2,
            'гречка' : 3,
            'котлета' : 4,
            'курица' : 5,
            'лимон' : 6,
            'макароны' : 7,
            'огурец' : 8,
            'помидор' : 9,
            'пюре' : 10,
            'салат' : 11,
            'тыква' : 12,
            'хлеб белый' : 13,
            'хлеб черный' : 14
}