from log.log_writer import log

def print_daily_report(products: list[tuple[str, int]]):
    total = sum(cal for _, cal in products)
    report = ""
    report += ("\n" + "=" * 40 + "\n")
    report +=("📊  Отчёт за сегодня".center(40) + "\n")
    report +=("=" * 40 + "\n")

    for i, (name, calories) in enumerate(products, 1):
        report += (f"{i:>2}. {name:<15} | {calories:>4} ккал" + "\n")

    report +=("-" * 40 + "\n")
    report +=(f"🔥  Всего калорий: {total} ккал".rjust(40) + "\n")
    report +=("=" * 40 + "\n")
    return report

def print_product_info( products: list[tuple[str,int]]):
    log('info',"\n" + "=" * 50 + "\n")
    log('info',"📋  Сводная таблица продуктов (ккал на 100г)".center(50) + "\n")
    log('info',"=" * 50 + "\n")

    for i, (name, cal) in enumerate(products.items(), 1):
        log('info',f"{i:>2}. {name:<25} | {cal:>4} ккал " + "\n")

    log('info',"=" * 50 + "\n" + "\n")


def print_help_info():
    return f'''👋 Привет!
Добро пожаловать в Калькулатор Калорий 🍎\n\n
Выбери действие ниже, чтобы начать:\n
📅 Установить суточные калории - устанавливает потолок калорий на день\n
➕ Добавить калории - добавляйте количество калорий после приема пищи\n
🔥 Калории сегодня - посмотреть сколько калорий было сегодня\n
🧠 Обучить модель - я потом уберу эту кнопку\n
📸 Распознать еду - модель предположит что за продукт и скажет вам его калорийность'''
